---
kind: property
id: P:Autodesk.Revit.DB.Visual.Checker.CheckerColor1
source: html/c629d5f1-b623-c84d-2c48-8f9ccabf5249.htm
---
# Autodesk.Revit.DB.Visual.Checker.CheckerColor1 Property

The property labeled "Color 1" from the "Checker" schema.

## Syntax (C#)
```csharp
public static string CheckerColor1 { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.